; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-3-8)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-2 - location
	p0-3 - location
	p0-4 - location
	p2-3 - location
	p2-5 - location
	p3-0 - location
	p3-1 - location
	p4-1 - location
	p5-0 - location
	p5-1 - location
	p5-4 - location
	p5-6 - location
	p6-2 - location
	p6-4 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s5)
	(at driver3 s1)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s4)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s1)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s5)
	(at package2 s5)
	(at package3 s0)
	(at package4 s3)
	(at package5 s6)
	(at package6 s3)
	(at package7 s2)
	(at package8 s2)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 6)
	(= (time-to-drive s1 s0) 6)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 73)
	(= (time-to-drive s2 s0) 73)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 73)
	(= (time-to-drive s3 s0) 73)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 84)
	(= (time-to-drive s1 s2) 84)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 50)
	(= (time-to-drive s4 s2) 50)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 19)
	(= (time-to-drive s1 s3) 19)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 27)
	(= (time-to-drive s5 s3) 27)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 53)
	(= (time-to-drive s6 s3) 53)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 76)
	(= (time-to-drive s1 s4) 76)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 92)
	(= (time-to-drive s1 s5) 92)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 69)
	(= (time-to-drive s0 s6) 69)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 68)
	(= (time-to-drive s1 s6) 68)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 33)
	(= (time-to-drive s2 s6) 33)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 80)
	(= (time-to-drive s5 s6) 80)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s1)
	(at truck3 s0)
	(at package1 s6)
	(at package2 s6)
	(at package3 s3)
	(at package4 s6)
	(at package5 s1)
	(at package6 s0)
	(at package7 s2)
	(at package8 s5)
	))

(:metric minimize (+ (* 1 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (board-truck driver3 truck3 s1)
   deleted: (at driver3 s1) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 2 of 11
2. (walk driver2 s5 p5-1)
   deleted: (at driver2 s5)
   added: (at driver2 p5-1)
   goals met: 2 of 11
3. (walk driver2 p5-1 s1)
   deleted: (at driver2 p5-1)
   added: (at driver2 s1)
   goals met: 3 of 11
4. (drive-truck truck3 s1 s0 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (fuel-used) from 0 to 60
   goals met: 4 of 11
5. (load-truck package3 truck3 s0)
   deleted: (at package3 s0)
   added: (in package3 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 4 of 11
6. (drive-truck truck3 s0 s6 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s6)
   changed: (fuel-used) from 60 to 819
   goals met: 3 of 11
7. (load-truck package5 truck3 s6)
   deleted: (at package5 s6)
   added: (in package5 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 3 of 11
8. (drive-truck truck3 s6 s3 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s3)
   changed: (fuel-used) from 819 to 1508
   goals met: 3 of 11
9. (unload-truck package3 truck3 s3)
   deleted: (in package3 truck3)
   added: (at package3 s3)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 4 of 11
10. (load-truck package4 truck3 s3)
   deleted: (at package4 s3)
   added: (in package4 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 4 of 11
11. (load-truck package6 truck3 s3)
   deleted: (at package6 s3)
   added: (in package6 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 4 of 11
12. (drive-truck truck3 s3 s6 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s6)
   changed: (fuel-used) from 1508 to 2356
   goals met: 4 of 11
13. (unload-truck package4 truck3 s6)
   deleted: (in package4 truck3)
   added: (at package4 s6)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 5 of 11
14. (drive-truck truck3 s6 s1 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s1)
   changed: (fuel-used) from 2356 to 3240
   goals met: 5 of 11
15. (unload-truck package5 truck3 s1)
   deleted: (in package5 truck3)
   added: (at package5 s1)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 6 of 11
16. (drive-truck truck3 s1 s2 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (fuel-used) from 3240 to 4164
   goals met: 6 of 11
17. (load-truck package8 truck3 s2)
   deleted: (at package8 s2)
   added: (in package8 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 6 of 11
18. (drive-truck truck3 s2 s0 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (fuel-used) from 4164 to 5113
   goals met: 7 of 11
19. (unload-truck package6 truck3 s0)
   deleted: (in package6 truck3)
   added: (at package6 s0)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 8 of 11
20. (drive-truck truck3 s0 s6 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s6)
   changed: (fuel-used) from 5113 to 5872
   goals met: 7 of 11
21. (drive-truck truck3 s6 s5 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   changed: (fuel-used) from 5872 to 6752
   goals met: 7 of 11
22. (unload-truck package8 truck3 s5)
   deleted: (in package8 truck3)
   added: (at package8 s5)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 8 of 11
23. (load-truck package1 truck3 s5)
   deleted: (at package1 s5)
   added: (in package1 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 8 of 11
24. (load-truck package2 truck3 s5)
   deleted: (at package2 s5)
   added: (in package2 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 8 of 11
25. (drive-truck truck3 s5 s6 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   changed: (fuel-used) from 6752 to 7792
   goals met: 8 of 11
26. (unload-truck package1 truck3 s6)
   deleted: (in package1 truck3)
   added: (at package1 s6)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 9 of 11
27. (unload-truck package2 truck3 s6)
   deleted: (in package2 truck3)
   added: (at package2 s6)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 10 of 11
28. (drive-truck truck3 s6 s0 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s0)
   changed: (fuel-used) from 7792 to 8482
   goals met: 11 of 11
